package pro.shamilabd.pastebin;

public class UnicArray {
    /**
     * @param a массив чисел, длина массива может быть больше 10 млн.
     * @return массив чисел, в которых нет дубликатов. Порядок чисел в
     * оригинальном массиве должен быть сохранён. Из дубликатов нужно оставлять последний
     * элемент, например, для [2,1,4,2,3] правильное решение [1,4,2,3], а не [2,1,4,3]
     * В случае, если во входном массиве есть элемент меньше 0, то нужно выдавать
     * ошибку. Например, для [2,3,-1,5] обработка должна закончиться ошибкой.
     */
    public static double[] task(double... a) {
        // TODO: реализовать
        return new double[1];
    }
}
